{
    "class_name": "Model",
    "config": {
        "name": "model_1",
        "layers": [
            {
                "name": "input_1",
                "class_name": "InputLayer",
                "config": {
                    "batch_input_shape": [
                        null,
                        1,
                        112,
                        112
                    ],
                    "dtype": "float32",
                    "sparse": false,
                    "name": "input_1"
                },
                "inbound_nodes": []
            },
            {
                "name": "input_2",
                "class_name": "InputLayer",
                "config": {
                    "batch_input_shape": [
                        null,
                        1,
                        112,
                        112
                    ],
                    "dtype": "float32",
                    "sparse": false,
                    "name": "input_2"
                },
                "inbound_nodes": []
            },
            {
                "name": "sequential_1",
                "class_name": "Sequential",
                "config": {
                    "name": "sequential_1",
                    "layers": [
                        {
                            "class_name": "Conv2D",
                            "config": {
                                "name": "conv2d_1",
                                "trainable": true,
                                "batch_input_shape": [
                                    null,
                                    1,
                                    112,
                                    112
                                ],
                                "dtype": "float32",
                                "filters": 16,
                                "kernel_size": [
                                    3,
                                    3
                                ],
                                "strides": [
                                    1,
                                    1
                                ],
                                "padding": "valid",
                                "data_format": "channels_first",
                                "dilation_rate": [
                                    1,
                                    1
                                ],
                                "activation": "linear",
                                "use_bias": true,
                                "kernel_initializer": {
                                    "class_name": "VarianceScaling",
                                    "config": {
                                        "scale": 1.0,
                                        "mode": "fan_avg",
                                        "distribution": "uniform",
                                        "seed": null
                                    }
                                },
                                "bias_initializer": {
                                    "class_name": "Zeros",
                                    "config": {}
                                },
                                "kernel_regularizer": null,
                                "bias_regularizer": null,
                                "activity_regularizer": null,
                                "kernel_constraint": null,
                                "bias_constraint": null
                            }
                        },
                        {
                            "class_name": "Activation",
                            "config": {
                                "name": "activation_1",
                                "trainable": true,
                                "activation": "relu"
                            }
                        },
                        {
                            "class_name": "MaxPooling2D",
                            "config": {
                                "name": "max_pooling2d_1",
                                "trainable": true,
                                "pool_size": [
                                    2,
                                    2
                                ],
                                "padding": "valid",
                                "strides": [
                                    2,
                                    2
                                ],
                                "data_format": "channels_last"
                            }
                        },
                        {
                            "class_name": "Dropout",
                            "config": {
                                "name": "dropout_1",
                                "trainable": true,
                                "rate": 0.25,
                                "noise_shape": null,
                                "seed": null
                            }
                        },
                        {
                            "class_name": "Conv2D",
                            "config": {
                                "name": "conv2d_2",
                                "trainable": true,
                                "filters": 32,
                                "kernel_size": [
                                    3,
                                    3
                                ],
                                "strides": [
                                    1,
                                    1
                                ],
                                "padding": "valid",
                                "data_format": "channels_first",
                                "dilation_rate": [
                                    1,
                                    1
                                ],
                                "activation": "linear",
                                "use_bias": true,
                                "kernel_initializer": {
                                    "class_name": "VarianceScaling",
                                    "config": {
                                        "scale": 1.0,
                                        "mode": "fan_avg",
                                        "distribution": "uniform",
                                        "seed": null
                                    }
                                },
                                "bias_initializer": {
                                    "class_name": "Zeros",
                                    "config": {}
                                },
                                "kernel_regularizer": null,
                                "bias_regularizer": null,
                                "activity_regularizer": null,
                                "kernel_constraint": null,
                                "bias_constraint": null
                            }
                        },
                        {
                            "class_name": "Activation",
                            "config": {
                                "name": "activation_2",
                                "trainable": true,
                                "activation": "relu"
                            }
                        },
                        {
                            "class_name": "MaxPooling2D",
                            "config": {
                                "name": "max_pooling2d_2",
                                "trainable": true,
                                "pool_size": [
                                    2,
                                    2
                                ],
                                "padding": "valid",
                                "strides": [
                                    2,
                                    2
                                ],
                                "data_format": "channels_first"
                            }
                        },
                        {
                            "class_name": "Dropout",
                            "config": {
                                "name": "dropout_2",
                                "trainable": true,
                                "rate": 0.25,
                                "noise_shape": null,
                                "seed": null
                            }
                        },
                        {
                            "class_name": "Conv2D",
                            "config": {
                                "name": "conv2d_3",
                                "trainable": true,
                                "filters": 16,
                                "kernel_size": [
                                    3,
                                    3
                                ],
                                "strides": [
                                    1,
                                    1
                                ],
                                "padding": "valid",
                                "data_format": "channels_first",
                                "dilation_rate": [
                                    1,
                                    1
                                ],
                                "activation": "linear",
                                "use_bias": true,
                                "kernel_initializer": {
                                    "class_name": "VarianceScaling",
                                    "config": {
                                        "scale": 1.0,
                                        "mode": "fan_avg",
                                        "distribution": "uniform",
                                        "seed": null
                                    }
                                },
                                "bias_initializer": {
                                    "class_name": "Zeros",
                                    "config": {}
                                },
                                "kernel_regularizer": null,
                                "bias_regularizer": null,
                                "activity_regularizer": null,
                                "kernel_constraint": null,
                                "bias_constraint": null
                            }
                        },
                        {
                            "class_name": "Activation",
                            "config": {
                                "name": "activation_3",
                                "trainable": true,
                                "activation": "relu"
                            }
                        },
                        {
                            "class_name": "MaxPooling2D",
                            "config": {
                                "name": "max_pooling2d_3",
                                "trainable": true,
                                "pool_size": [
                                    2,
                                    2
                                ],
                                "padding": "valid",
                                "strides": [
                                    2,
                                    2
                                ],
                                "data_format": "channels_first"
                            }
                        },
                        {
                            "class_name": "Dropout",
                            "config": {
                                "name": "dropout_3",
                                "trainable": true,
                                "rate": 0.25,
                                "noise_shape": null,
                                "seed": null
                            }
                        },
                        {
                            "class_name": "Flatten",
                            "config": {
                                "name": "flatten_1",
                                "trainable": true,
                                "data_format": "channels_last"
                            }
                        },
                        {
                            "class_name": "Dense",
                            "config": {
                                "name": "dense_1",
                                "trainable": true,
                                "units": 128,
                                "activation": "relu",
                                "use_bias": true,
                                "kernel_initializer": {
                                    "class_name": "VarianceScaling",
                                    "config": {
                                        "scale": 1.0,
                                        "mode": "fan_avg",
                                        "distribution": "uniform",
                                        "seed": null
                                    }
                                },
                                "bias_initializer": {
                                    "class_name": "Zeros",
                                    "config": {}
                                },
                                "kernel_regularizer": null,
                                "bias_regularizer": null,
                                "activity_regularizer": null,
                                "kernel_constraint": null,
                                "bias_constraint": null
                            }
                        },
                        {
                            "class_name": "Dropout",
                            "config": {
                                "name": "dropout_4",
                                "trainable": true,
                                "rate": 0.1,
                                "noise_shape": null,
                                "seed": null
                            }
                        },
                        {
                            "class_name": "Dense",
                            "config": {
                                "name": "dense_2",
                                "trainable": true,
                                "units": 50,
                                "activation": "relu",
                                "use_bias": true,
                                "kernel_initializer": {
                                    "class_name": "VarianceScaling",
                                    "config": {
                                        "scale": 1.0,
                                        "mode": "fan_avg",
                                        "distribution": "uniform",
                                        "seed": null
                                    }
                                },
                                "bias_initializer": {
                                    "class_name": "Zeros",
                                    "config": {}
                                },
                                "kernel_regularizer": null,
                                "bias_regularizer": null,
                                "activity_regularizer": null,
                                "kernel_constraint": null,
                                "bias_constraint": null
                            }
                        }
                    ]
                },
                "inbound_nodes": [
                    [
                        [
                            "input_1",
                            0,
                            0,
                            {}
                        ]
                    ],
                    [
                        [
                            "input_2",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "lambda_1",
                "class_name": "Lambda",
                "config": {
                    "name": "lambda_1",
                    "trainable": true,
                    "function": [
                        "4wEAAAAAAAAAAwAAAAYAAABDAAAAcygAAAB8AFwCfQF9AnQAagF0AGoCdABqA3wBfAIYAIMBZAFk\nAmQDjQODAVMAKQRO6QEAAABUKQLaBGF4aXPaCGtlZXBkaW1zKQTaAUvaBHNxcnTaA3N1bdoGc3F1\nYXJlKQNaBXZlY3Rz2gF42gF5qQByCgAAAPoePGlweXRob24taW5wdXQtMy03MDIyMmJhOTk0NzA+\n2hJldWNsaWRlYW5fZGlzdGFuY2UWAAAAcwQAAAAAAQgB\n",
                        null,
                        null
                    ],
                    "function_type": "lambda",
                    "output_shape": [
                        "4wEAAAAAAAAAAwAAAAIAAABDAAAAcxQAAAB8AFwCfQF9AnwBZAEZAGQCZgJTACkDTukAAAAA6QEA\nAACpACkD2gZzaGFwZXPaBnNoYXBlMdoGc2hhcGUycgMAAAByAwAAAPoePGlweXRob24taW5wdXQt\nMy03MDIyMmJhOTk0NzA+2hZldWNsX2Rpc3Rfb3V0cHV0X3NoYXBlGwAAAHMEAAAAAAEIAQ==\n",
                        null,
                        null
                    ],
                    "output_shape_type": "lambda",
                    "arguments": {}
                },
                "inbound_nodes": [
                    [
                        [
                            "sequential_1",
                            1,
                            0,
                            {}
                        ],
                        [
                            "sequential_1",
                            2,
                            0,
                            {}
                        ]
                    ]
                ]
            }
        ],
        "input_layers": [
            [
                "input_1",
                0,
                0
            ],
            [
                "input_2",
                0,
                0
            ]
        ],
        "output_layers": [
            [
                "lambda_1",
                0,
                0
            ]
        ]
    },
    "keras_version": "2.2.4",
    "backend": "tensorflow"
}